In [1]:
import numpy as np
import pandas as pd

In [2]:
data = np.random.randn(4,3)
data

array([[ 1.23949951, -0.84812519, -0.64771518],
       [ 0.34425182, -0.45279599,  0.47759922],
       [-0.66551824, -1.58578236,  0.42668637],
       [-0.03945007,  0.98664829, -0.9639203 ]])

In [3]:
dataFrame = pd.DataFrame(data)
dataFrame

          0         1         2
0  1.239500 -0.848125 -0.647715
1  0.344252 -0.452796  0.477599
2 -0.665518 -1.585782  0.426686
3 -0.039450  0.986648 -0.963920

In [4]:
dataFrame[0]

0    1.239500
1    0.344252
2   -0.665518
3   -0.039450
Name: 0, dtype: float64

In [5]:
type(dataFrame[0])

pandas.core.series.Series

In [6]:
yeniDataFrame = pd.DataFrame(data, index = ["ali", "veli", "deli", "pamuk"], columns = ["Maas", "Yas", "Calısma Saati"])
yeniDataFrame

           Maas       Yas  Calısma Saati
ali    1.239500 -0.848125      -0.647715
veli   0.344252 -0.452796       0.477599
deli  -0.665518 -1.585782       0.426686
pamuk -0.039450  0.986648      -0.963920

In [7]:
yeniDataFrame["Yas"]

ali     -0.848125
veli    -0.452796
deli    -1.585782
pamuk    0.986648
Name: Yas, dtype: float64

In [8]:
yeniDataFrame["Calısma Saati"]

ali     -0.647715
veli     0.477599
deli     0.426686
pamuk   -0.963920
Name: Calısma Saati, dtype: float64

In [9]:
yeniDataFrame[["Maas", "Yas"]]

           Maas       Yas
ali    1.239500 -0.848125
veli   0.344252 -0.452796
deli  -0.665518 -1.585782
pamuk -0.039450  0.986648

In [10]:
yeniDataFrame.loc["pamuk"] # satrıdaki verileri loc(locate) ile getirebiliyoruz

Maas            -0.039450
Yas              0.986648
Calısma Saati   -0.963920
Name: pamuk, dtype: float64

In [11]:
yeniDataFrame.iloc[1] # bu da index bazlı location ı getiriyor

Maas             0.344252
Yas             -0.452796
Calısma Saati    0.477599
Name: veli, dtype: float64

In [12]:
# yeni bir column (sütun) nasıl ekleriz:

In [13]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]
yeniDataFrame

           Maas       Yas  Calısma Saati  Emeklilik Yasi
ali    1.239500 -0.848125      -0.647715       -1.696250
veli   0.344252 -0.452796       0.477599       -0.905592
deli  -0.665518 -1.585782       0.426686       -3.171565
pamuk -0.039450  0.986648      -0.963920        1.973297

In [14]:
#eğer bir column u düşürmek istersek:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1) # axis 1 sütun, axis 0 satır

           Maas       Yas  Calısma Saati
ali    1.239500 -0.848125      -0.647715
veli   0.344252 -0.452796       0.477599
deli  -0.665518 -1.585782       0.426686
pamuk -0.039450  0.986648      -0.963920

In [15]:
yeniDataFrame

           Maas       Yas  Calısma Saati  Emeklilik Yasi
ali    1.239500 -0.848125      -0.647715       -1.696250
veli   0.344252 -0.452796       0.477599       -0.905592
deli  -0.665518 -1.585782       0.426686       -3.171565
pamuk -0.039450  0.986648      -0.963920        1.973297

In [16]:
# eğer biz dataframe de yaptığımız işlemi belirtmezsek başka bir yere üzerinde incelediğimiz
# etmenler asıl dataframe etki etmez, değişikliğe neden olmaz.

In [17]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1, inplace = True)
# bu şekilde yaparsak dataframe in üzerinde değişikliği yapar.
yeniDataFrame

           Maas       Yas  Calısma Saati
ali    1.239500 -0.848125      -0.647715
veli   0.344252 -0.452796       0.477599
deli  -0.665518 -1.585782       0.426686
pamuk -0.039450  0.986648      -0.963920

In [18]:
yeniDataFrame.loc["veli"]["Yas"]

-0.4527959874928861

In [19]:
yeniDataFrame.loc["veli", "Yas"] #bu şekilde de yapabilriz

-0.4527959874928861

In [20]:
yeniDataFrame < 0

        Maas    Yas  Calısma Saati
ali    False   True           True
veli   False   True          False
deli    True   True          False
pamuk   True  False           True

In [21]:
booleanFrame = yeniDataFrame < 0
yeniDataFrame[booleanFrame]

           Maas       Yas  Calısma Saati
ali         NaN -0.848125      -0.647715
veli        NaN -0.452796            NaN
deli  -0.665518 -1.585782            NaN
pamuk -0.039450       NaN      -0.963920

In [22]:
yeniDataFrame[yeniDataFrame < 0] # bu da aynı şeyi verir

           Maas       Yas  Calısma Saati
ali         NaN -0.848125      -0.647715
veli        NaN -0.452796            NaN
deli  -0.665518 -1.585782            NaN
pamuk -0.039450       NaN      -0.963920

In [23]:
yeniDataFrame[yeniDataFrame["Maas"] > 0]

          Maas       Yas  Calısma Saati
ali   1.239500 -0.848125      -0.647715
veli  0.344252 -0.452796       0.477599

In [24]:
# bu şekilde filtreleme yapabiliriz

In [25]:
# index resetleemk istersek:
yeniDataFrame.reset_index()
# bu şekilde bizim yazdıklarımızı index e alıyor

   index      Maas       Yas  Calısma Saati
0    ali  1.239500 -0.848125      -0.647715
1   veli  0.344252 -0.452796       0.477599
2   deli -0.665518 -1.585782       0.426686
3  pamuk -0.039450  0.986648      -0.963920

In [26]:
yeniIndexListesi = ["al", "ve", "de", "pa"]

In [27]:
# dataframde bulunan bir sütunda değişiklik yapmak istedik mesela:
yeniDataFrame["Yeni Index"] = yeniIndexListesi
yeniDataFrame

           Maas       Yas  Calısma Saati Yeni Index
ali    1.239500 -0.848125      -0.647715         al
veli   0.344252 -0.452796       0.477599         ve
deli  -0.665518 -1.585782       0.426686         de
pamuk -0.039450  0.986648      -0.963920         pa

In [28]:
yeniDataFrame.set_index("Yeni Index")

                Maas       Yas  Calısma Saati
Yeni Index
al          1.239500 -0.848125      -0.647715
ve          0.344252 -0.452796       0.477599
de         -0.665518 -1.585782       0.426686
pa         -0.039450  0.986648      -0.963920

In [29]:
# burada görüleceği gibi yine etki etmedik etki edebilmek için:
yeniDataFrame

           Maas       Yas  Calısma Saati Yeni Index
ali    1.239500 -0.848125      -0.647715         al
veli   0.344252 -0.452796       0.477599         ve
deli  -0.665518 -1.585782       0.426686         de
pamuk -0.039450  0.986648      -0.963920         pa

In [30]:
yeniDataFrame.set_index("Yeni Index", inplace = True)
yeniDataFrame

                Maas       Yas  Calısma Saati
Yeni Index
al          1.239500 -0.848125      -0.647715
ve          0.344252 -0.452796       0.477599
de         -0.665518 -1.585782       0.426686
pa         -0.039450  0.986648      -0.963920

## Multi İndeks

In [31]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [32]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [33]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [34]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [35]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[9,"E"],[9,"F"]]

In [36]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [37]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index = birlesmisIndeks,columns = ["Yas","Meslek"])
cizgiFilmDataFrame
# bunu yaptığımızda excel de hazırladığımız gibi bir multi index e ulaşmış olacağız.

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny     9      E
           Kyle      9      F

In [38]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [39]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]
# daha önce yaptıklarımız gibi burada da çağırabiliyoruz

Yas       9
Meslek    E
Name: Kenny, dtype: object

In [40]:
cizgiFilmDataFrame  # burada da gördüğümüz gibi istersek multi index in olduğu yerin üsütne de isim verebiliriz

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny     9      E
           Kyle      9      F

In [41]:
cizgiFilmDataFrame.index.names = ["Film Adı","İsim"]
# bu şekilde isimde ekleyebiliriz
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny     9      E
           Kyle      9      F